Config/Documents/СсылкиНаОплатуЧерезПлатежнуюСистему.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СсылкиНаОплатуЧерезПлатежнуюСистему</Name>
			<BasedOn>
				<xr:Item>Document.СсылкиНаОплатуЧерезПлатежнуюСистему</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыДоговораЭквайринга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыДоговораЭквайринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СсылкиНаОплатуЧерезПлатежнуюСистему</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СсылкиНаОплату</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактнаяИнформация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтактнойИнформации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Учащийся</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Дети</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнениеНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ПлановыеДатыОплатыОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеДатыОплатыОбразование</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвтоРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Учащийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Факультет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ПараметрыСписанияДоходовБудущихПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыСписанияДоходовБудущихПериодов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийНачисленияДБП</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПринятияКУчетуПравПользованияОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособПризнанияДоходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПризнанияРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаСписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияСписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходов1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходов2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоДоходов3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиНУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДеятельностиДляНалоговогоУчетаЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетДоходовНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяПрочихДоходовНУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ПлательщикиПоДоговоруОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлательщикиПоДоговоруОбразование</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядокВыпискиСФ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокВыпискиСФЗаУслуги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/СсылкиНаОплатуЧерезПлатежнуюСистему/Forms/ФормаЗаполненияПоДаннымУчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Организация	= Параметры.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ДанныеНачислений.Количество() > 0 И НЕ ЗакрытьФорму И НЕ ПеренестиДанные Тогда 
		ТекстВопроса 	= НСтр("ru = 'Данные начислений не будут перенесены в документ. Закрыть форму?'");
		Оповещение 		= Новый ОписаниеОповещения("ЗакрытьФормуЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Если ДанныеНачислений.Количество() = 0 Тогда  
		ПеренестиДанные = Истина; 
		Закрыть();
	Иначе
		ПеренестиДанные = Истина;
		АдресДанныхВхранилище = ПоместитьДанныеВхранилище();
		Закрыть(АдресДанныхВхранилище);
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПлановыеДатыОплатыОбразованиеСрезПоследних.Учащийся КАК Учащийся,
	               |	ПлановыеДатыОплатыОбразованиеСрезПоследних.Сумма КАК Сумма,
	               |	ПараметрыСписанияДоходовБудущихПериодовСрезПоследних.Договор КАК ДоговорСвязи,
	               |	ПлановыеДатыОплатыОбразованиеСрезПоследних.Валюта КАК Валюта,
	               |	ПлановыеДатыОплатыОбразованиеСрезПоследних.Договор КАК Договор
	               |ПОМЕСТИТЬ ВТДанныеНачислений
	               |ИЗ
	               |	РегистрСведений.ПлановыеДатыОплатыОбразование.СрезПоследних(&Дата, ДатаОплаты МЕЖДУ &НачалоПериода И &КонецПериода) КАК ПлановыеДатыОплатыОбразованиеСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыСписанияДоходовБудущихПериодов.СрезПоследних(&Дата, ) КАК ПараметрыСписанияДоходовБудущихПериодовСрезПоследних
	               |		ПО ПлановыеДатыОплатыОбразованиеСрезПоследних.Договор = ПараметрыСписанияДоходовБудущихПериодовСрезПоследних.Договор
	               |ГДЕ
	               |	ПлановыеДатыОплатыОбразованиеСрезПоследних.Сумма > 0
	               |	И &УсловиеФакультет
	               |	И ПлановыеДатыОплатыОбразованиеСрезПоследних.Договор.Организация = &Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ПлательщикиПоДоговоруОбразованиеСрезПоследних.Контрагент ЕСТЬ NULL
	               |			ТОГДА ВТДанныеНачислений.Сумма
	               |		ИНАЧЕ ВТДанныеНачислений.Сумма / 100 * ПлательщикиПоДоговоруОбразованиеСрезПоследних.ДоляОплаты
	               |	КОНЕЦ КАК Сумма,
	               |	ВТДанныеНачислений.Договор КАК Договор,
	               |	ЕСТЬNULL(ПлательщикиПоДоговоруОбразованиеСрезПоследних.Контрагент, ВТДанныеНачислений.Учащийся.Контрагент) КАК Контрагент,
	               |	ВТДанныеНачислений.Учащийся КАК Учащийся,
	               |	ВТДанныеНачислений.Валюта КАК Валюта
	               |ПОМЕСТИТЬ ВТНачисленияИПлательщики
	               |ИЗ
	               |	ВТДанныеНачислений КАК ВТДанныеНачислений
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлательщикиПоДоговоруОбразование.СрезПоследних(&Дата, ) КАК ПлательщикиПоДоговоруОбразованиеСрезПоследних
	               |		ПО ВТДанныеНачислений.Учащийся = ПлательщикиПоДоговоруОбразованиеСрезПоследних.Студент
	               |ГДЕ
	               |	ПлательщикиПоДоговоруОбразованиеСрезПоследних.Активность = ИСТИНА
	               |	И (ВТДанныеНачислений.ДоговорСвязи ЕСТЬ NULL) = &УсловиеТипДоговора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ВТНачисленияИПлательщики.Валюта = &РегламентнаяВалюта
	               |			ТОГДА ВТНачисленияИПлательщики.Сумма
	               |		ИНАЧЕ ВЫРАЗИТЬ(ВТНачисленияИПлательщики.Сумма * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК ЧИСЛО(15, 2))
	               |	КОНЕЦ КАК Сумма,
	               |	ВТНачисленияИПлательщики.Договор КАК Договор,
	               |	ВТНачисленияИПлательщики.Контрагент КАК Контрагент,
	               |	ВТНачисленияИПлательщики.Учащийся КАК Учащийся
	               |ИЗ
	               |	ВТНачисленияИПлательщики КАК ВТНачисленияИПлательщики
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютСрезПоследних
	               |		ПО ВТНачисленияИПлательщики.Валюта = КурсыВалютСрезПоследних.Валюта";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата"				, Период.ДатаОкончания); 
	Запрос.УстановитьПараметр("НачалоПериода"		, Период.ДатаНачала);
    Запрос.УстановитьПараметр("КонецПериода"		, Период.ДатаОкончания);  
	Запрос.УстановитьПараметр("Организация"			, Организация); 
	Запрос.УстановитьПараметр("РегламентнаяВалюта"	, ОбщегоНазначенияБГУПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	Если ЗначениеЗаполнено(Факультет) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеФакультет", "ПлановыеДатыОплатыОбразованиеСрезПоследних.Факультет = &Факультет");
		Запрос.УстановитьПараметр("Факультет", Факультет);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеФакультет", "ИСТИНА");
	КонецЕсли;
	Если ТипДоговора = 0 Тогда 
		Запрос.УстановитьПараметр("УсловиеТипДоговора", Ложь);
	Иначе 
		Запрос.УстановитьПараметр("УсловиеТипДоговора", Истина);
	КонецЕсли;	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ДанныеНачислений.Загрузить(РезультатЗапроса);
	
КонецПроцедуры

&НаСервере 
Функция ПоместитьДанныеВхранилище()
	
	ТаблицаНачислений 		= ДанныеНачислений.Выгрузить();
	АдресДанныхВХранилище 	= ПоместитьВоВременноеХранилище(ТаблицаНачислений, УникальныйИдентификатор);
	Возврат АдресДанныхВХранилище;
	
КонецФункции	

&НаКлиенте
Процедура ЗакрытьФормуЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда 
		ЗакрытьФорму = Истина;
		ЭтаФорма.Закрыть();
	КонецЕсли;	
		
КонецПроцедуры		
		
#КонецОбласти
